app/controllers/clients_controller.rb

  def index
    @clients = Client.all :order => 'name ASC'
---
SELECT * FROM "clients"

  def show
    @show_timeline = true
    @client = Client.find(params[:id])
---
SELECT * FROM "clients" WHERE ("clients"."id" = 1)

  def edit
    @client = Client.find(params[:id])
---
SELECT * FROM "clients" WHERE ("clients"."id" = 1)

  def create
    @client = Client.new(params[:client])

    if @client.save
---
INSERT INTO "clients" ("name", "description") VALUES('xfgxdf', NULL)

  def update
    @client = Client.find(params[:id])

    if @client.update_attributes(params[:client])
---
SELECT * FROM "clients" WHERE ("clients"."id" = 1)
UPDATE "clients" SET "name" = 'Nike' WHERE "id" = 1