app/controllers/projects_controller.rb

SELECT * FROM "projects"
---
  def index
    if params[:user_id]
      @user = User.find(params[:user_id])
      @projects = @user.projects
    else
      @projects = Project.all

SELECT * FROM "projects" WHERE ("projects"."id" = 5)
---
  def show
    @show_timeline = true
    @project = Project.find(params[:id])

SELECT * FROM "clients" WHERE ("clients"."id" = 1)
---
  def new
    client = Client.find(params[:client_id]) if params[:client_id]

INSERT INTO "projects" ("name", "client_id", "description", "end_date") VALUES('akdgs\', 1, 'asdfsdfsd sefsdf sd', '2009-03-20 00:00:00')
---
  def create
    @project = Project.new(params[:project])

    if @project.save

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
UPDATE "projects" SET "end_date" = '2009-04-14 00:00:00', "description" = '' WHERE "id" = 1
---
  def update
    @project = Project.find(params[:id])

    if @project.update_attributes params[:project]

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
DELETE FROM "projects" WHERE "id" = 1
---
  def destroy
    project = Project.find(params[:id])
    project.destroy