app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all :order => 'end_date DESC'
---
SELECT * FROM "tasks"