app/controllers/tasks_controller.rb

  def show
    @project = Project.find(params[:project_id])
    @task = @project.tasks.find(params[:id])
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1 AND ("tasks".project_id = 1)) ORDER BY end_date ASC

  def create
    @task = Task.new(params[:task])

    if @task.save
---
INSERT INTO "tasks" ("name", "completed", "project_id", "description", "end_date") VALUES('do something', 'f', 1, 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Donec tincidunt nunc eget nisl. Sed sed arcu quis nisl semper congue. Ut sem nisi, bibendum ut, tempus fringilla, vehicula eget, nisl. In hac habitasse platea dictumst. Sed malesuada vestibulum diam. Vivamus nibh tortor, malesuada sit amet, ullamcorper sit amet, aliquet ac, metus. Suspendisse quis urna. Vivamus rutrum. Duis quam. Morbi id augue.

  def mark_completed
    @task = Task.find(params[:id])
    @task.update_attributes :completed => true
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
UPDATE "tasks" SET "completed" = 't' WHERE "id" = 1

  def mark_open
    @task = Task.find(params[:id])
    @task.update_attributes :completed => false
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
UPDATE "tasks" SET "completed" = 'f' WHERE "id" = 1

  def destroy
    Task.find(params[:id]).destroy
---
DELETE FROM "tasks" WHERE "id" = 2
SELECT * FROM "tasks" WHERE ("tasks"."id" = 2)