app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "password_salt", "persistence_token", "login") VALUES('2009-03-19 14:32:10', '5d6d0de572cfc9ccb37d004ee3e52587764ea0f5c73c98f97fb495d04e1352301ca6f84e1f522203ee2f5300c5c48057c815494b5c14ded694d310defa067a7d', '2009-03-19 14:32:10', 'ad04247fc4e34faebabe62bce88c8a2052e0e0b4d6bc79c4b5c598e1c5777592f1d5b1ed89d4cf12c848c5387625e8a075b56dd774a081683cf25536ea1cad57', 'af9a274382d273ff61fa899a8fdf42abb7da16ba6a8f919f4f0ad1c3fd1f8031c36179dcc5f7d075beb6d539f7d28471d6a73248dfe4e2826d80978eede27007', 'wolas')
---
  def create
    @user = User.new(params[:user])
    if @user.save